In [2]:
# Basic Functionality of pandas

import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

#Create a DataFrame
df = pd.DataFrame(d)
print ("Our data series is:")
df

Our data series is:

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [3]:
# T (Transpose) The rows and columns will interch
df.T

           0      1      2     3      4      5     6
Name     Tom  James  Ricky   Vin  Steve  Smith  Jack
Age       25     26     25    23     30     29    23
Rating  4.23   3.24   3.98  2.56    3.2    4.6   3.8

In [4]:
# axes (Returns the list of row axis labels and column axis labels.)
df.axes

[RangeIndex(start=0, stop=7, step=1),
 Index(['Name', 'Age', 'Rating'], dtype='object')]

In [5]:
# dtypes (Returns the data type of each column.)
df.dtypes

Name       object
Age         int64
Rating    float64
dtype: object

In [6]:
# empty (Returns the Boolean value saying whether the Object is empty or not; True indicates that the object is empty.)
df.empty

False

In [7]:
# ndim (Returns the number of dimensions of the object. By definition, DataFrame is a 2D object.)
df.ndim

2

In [8]:
# shape (Returns a tuple representing the dimensionality of the DataFrame. Tuple (a,b), where a represents the number of rows and b represents the number of columns.)

df.shape

(7, 3)

In [9]:
# size(Returns the number of elements in the DataFrame)

df.size

21

In [10]:
# values (eturns the actual data in the DataFrame as an NDarray.)
df.values

array([['Tom', 25, 4.23],
       ['James', 26, 3.24],
       ['Ricky', 25, 3.98],
       ['Vin', 23, 2.56],
       ['Steve', 30, 3.2],
       ['Smith', 29, 4.6],
       ['Jack', 23, 3.8]], dtype=object)

In [11]:
# head() returns the first n rows (observe the index values).
df.head()

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20

In [14]:
df.head(2)

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24

In [13]:
# tail() returns the last n rows (observe the index values).

df.tail()

    Name  Age  Rating
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [15]:
df.tail(2)

    Name  Age  Rating
5  Smith   29     4.6
6   Jack   23     3.8